{
  "name": "Jordan T. Romero",
  "title": "Senior Software Engineer",
  "contact": {
    "phone": "512-348-0227",
    "email": "jordan.t.romero@gmail.com",
    "links": {
      "github": "https://github.com/your-profile",
      "medium": "https://medium.com/your-profile",
      "linkedin": "https://linkedin.com/in/your-profile"
    }
  },
  "summary": "An observant and innovative software engineer with a proven ability to deliver efficient and user-focused solutions. Boasts strong practical programming skills, effective communication, and robust project management capabilities, fostering productive work environments and team-centric projects. Committed to continuous learning, UI/UX design, and adopting the latest technologies to drive advancements in software development.",
  "skills": {
    "topSkills": [
      { "name": "JavaScript", "level": 90 },
      { "name": "React", "level": 85 },
      { "name": "Node.js", "level": 80 },
      { "name": "Next.js", "level": 80 },
      { "name": "TypeScript", "level": 80 },
      { "name": "GraphQL", "level": 80 },
      { "name": "Material-UI", "level": 85 },
      { "name": "PostgreSQL", "level": 80 },
      { "name": "Playwright", "level": 80 },
      { "name": "CSS", "level": 90 },
      { "name": "HTML", "level": 90 },
      { "name": "GitHub", "level": 90 }
    ],
    "frontend": [
      "JavaScript (ES6)",
      "React",
      "TypeScript",
      "Material-UI",
      "React Native",
      "Redux",
      "HTML",
      "CSS",
      "SASS"
    ],
    "backend": [
      "Node.js",
      "GraphQL",
      "Ruby",
      "Rails",
      "Prisma",
      "Express",
      "RESTful APIs"
    ],
    "database": ["SQLite3", "PostgreSQL", "Supabase", "Firebase"],
    "testing": ["Jest", "Cypress", "Playwright", "React Testing Library"],
    "devOps": ["AWS", "EKS", "Docker", "Kubernetes"],
    "design": ["Figma", "Sketch", "Storybook"],
    "cicd": ["CircleCI", "GitHub Actions", "Netlify", "Vercel"],
    "other": ["Auth0", "Retool", "OAuth", "WebSockets"]
  },
  "experience": [
    {
      "company": "Resilia",
      "role": "Senior Software Engineer",
      "duration": "June 2022 - Present",
      "highLevelDescription": "Spearheaded development and design efforts across Resilia's platform, delivering high-impact solutions using a modern tech stack.",
      "responsibilities": [
        "Spearheaded development projects utilizing a comprehensive tech stack: React, TypeScript, Node.js, GraphQL, Prisma, PostgreSQL, and Auth0, significantly enhancing platform capabilities and user experience.",
        "Architected and implemented microservices-based solutions, leveraging AWS services and Amazon EKS (Elastic Kubernetes Service) to improve scalability and maintainability of the platform.",
        "Played a key role in building and implementing the funder platform, a critical component of Resilia's offering, demonstrating ability to deliver complex, high-impact features.",
        "Contributed to every aspect of the Resilia platform, touching and improving various features across the entire system, showcasing deep understanding and versatility.",
        "Collaborated closely with product and design teams to expedite feature rollouts and troubleshoot issues, improving project delivery times and cross-functional teamwork.",
        "Mentored junior developers, promoting best practices in modern web development, cloud architecture, and fostering a culture of continuous learning and improvement.",
        "Implemented robust error handling and logging systems to enhance application reliability in a distributed microservices environment."
      ],
      "projects": [
        {
          "name": "Overview of Collaborated Goal Experience",
          "description": "Implemented analytics tracking in the dashboard actions module to provide actionable insights.",
          "loomUrl": "https://www.loom.com/share/21de8d87d5c14e4f99eb8f41d10e5cb2",
          "image": "/images/collaborated-goal.png"
        },
        {
          "name": "Executive Dashboard Overview",
          "description": "Streamlined executive reporting with real-time data, enhancing decision-making efficiency.",
          "loomUrl": "https://www.loom.com/share/1f94a08f17e248248530bd6cbd2e628f",
          "image": "/images/executive-dashboard.png"
        },
        {
          "name": "Funder Goals Page",
          "description": "Enabled funders to track goals and measure impact through intuitive, user-friendly tools.",
          "loomUrl": "https://www.loom.com/share/58e017062c11413cb5576adb609fd82e",
          "image": "/images/funder-goals.png"
        },
        {
          "name": "Needs Assessment",
          "description": "Designed and deployed tools for evaluating user needs, boosting customer satisfaction.",
          "loomUrl": "https://www.loom.com/share/d36f631d540642f38ef5e866f13e952c",
          "image": "/images/needs-assessment.png"
        }
      ]
    },
    {
      "company": "Knock",
      "role": "Software Engineer",
      "duration": "April 2021 - March 2022",
      "highLevelDescription": "Developed responsive, scalable UI and optimized app performance in a fast-paced, start-up environment.",
      "responsibilities": [
        "Utilized strong practical programming skills to build products quickly and efficiently in a high-paced, start-up environment.",
        "Worked closely across teams to produce quality, responsive UI with React and React Native.",
        "Implemented and analyzed A/B tests to optimize user experience and inform product decisions.",
        "Led the development and successful launch of a new product within a two-week timeframe, demonstrating ability to deliver under tight deadlines.",
        "Developed and launched key product features, contributing to improved user retention.",
        "Optimized API integration to enhance app performance and reduce load times.",
        "Collaborated with UX/UI designers to implement responsive designs, improving mobile user experience."
      ],
      "projects": [
        {
          "name": "Website Revamp",
          "description": "Redesigned and implemented the company's marketing website to align with brand standards and improve user experience. Focused on responsive design and SEO optimization.",
          "image": "/images/knock-website-revamp.png"
        },
        {
          "name": "Guaranteed Offer Product Release",
          "description": "Led the development and release of the 'Guaranteed Offer' product. Delivered all marketing materials, web updates, and product launch elements within two weeks.",
          "image": "/images/knock-guaranteed-offer.png"
        }
      ]
    }, 
    {
      "company": "ActingAccents.com",
      "role": "Founding Software Engineer - Freelance",
      "duration": "On-going",
      "highLevelDescription": "Solely responsible for designing and developing ActingAccents.com's platform, including a pre-launch landing page and an innovative online course focused on dialect training using the International Phonetic Alphabet.",
      "responsibilities": [
        "Spearheaded the development of the platform using Next.js, TypeScript, Supabase, PostgreSQL, Prisma, AWS, and Node.js, ensuring a robust and scalable architecture.",
        "Designed and launched a pre-launch landing page that provides class context, enables user sign-ups, and aligns with branding standards.",
        "Collaborated with stakeholders to refine user experience and improve engagement through responsive design and SEO optimization.",
        "Implemented API integrations to manage user data and streamline workflows.",
        "Currently developing an online course that teaches users how to speak in various dialects using the International Phonetic Alphabet, incorporating interactive features and seamless user navigation.",
        "Utilized Vercel for deployment, ensuring fast and reliable delivery of features in a live environment.",
        "Optimized application performance by implementing efficient database queries and reducing load times."
      ],
      "projects": [
        {
          "name": "Pre-launch Landing Page",
          "description": "Developed a responsive, scalable landing page using Next.js and TypeScript. The page provides detailed class information, allows users to sign up, and integrates with Supabase for data management.",
          "image": "/images/prelaunch-landing-page.png"
        },
        {
          "name": "Online Dialect Course",
          "description": "Currently building an interactive online course using Next.js, Supabase, and Prisma. The course leverages the International Phonetic Alphabet to teach users various dialects and accents.",
          "image": "/images/online-dialect-course.png"
        }
      ]
    }
    
  ]
}
